released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "smbus_slave_core.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/

typedef enum
{
    SMBUS_PROTOCOL_NONE = 0,
    SMBUS_PROTOCOL_READ,
    SMBUS_PROTOCOL_BLOCK_WRITE,
    SMBUS_PROTOCOL_WRITE_BYTE,
    SMBUS_PROTOCOL_WRITE_WORD,
    SMBUS_PROTOCOL_SEND_BYTE
} SMBUS_PROTOCOL_T;

/*_____ D E F I N I T I O N S ______________________________________________*/

#define SMBUS_EVENT_TIMEOUT                  (0x01U)
#define SMBUS_EVENT_BUS_ERROR                (0x02U)
#define SMBUS_EVENT_PEC_ERROR                (0x04U)
#define SMBUS_EVENT_UNSUPPORTED              (0x08U)
#define SMBUS_EVENT_WRITE_DONE               (0x10U)
#define SMBUS_EVENT_RECOVERED                (0x20U)
#if PMBUS_DEBUG_ENABLE
#define SMBUS_EVENT_DEBUG_RX                 (0x40U)
#define SMBUS_EVENT_DEBUG_TX                 (0x80U)
#endif

#define SMBUS_STATUS_WORD_CML                (0x0002U)

#if PMBUS_DEBUG_ENABLE
#define SMBUS_DEBUG_PROTOCOL_NONE            (0U)
#define SMBUS_DEBUG_PROTOCOL_SEND_BYTE       (1U)
#define SMBUS_DEBUG_PROTOCOL_WRITE_BYTE      (2U)
#define SMBUS_DEBUG_PROTOCOL_WRITE_WORD      (3U)
#define SMBUS_DEBUG_PROTOCOL_READ_BYTE       (4U)
#define SMBUS_DEBUG_PROTOCOL_READ_WORD       (5U)
#define SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE     (7U)
#define SMBUS_DEBUG_PROTOCOL_BLOCK_READ      (8U)
#endif

static const char g_smbus_mfr_id[] = "MFR_ID_001";
static const char g_smbus_mfr_model[] = "MFR_MODEL_001";

/*_____ M A C R O S ________________________________________________________*/

#define SMBUS_ADDRESS_WRITE(addr7)           ((uint8_t)((addr7) << 1U))
#define SMBUS_ADDRESS_READ(addr7)            ((uint8_t)(((addr7) << 1U) | 0x01U))

/*_____ F U N C T I O N S __________________________________________________*/

static void smbus_set_event(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t event_id, uint8_t command, uint8_t status)
{
    ctx->event_flags = (uint8_t)(ctx->event_flags | event_id);
    ctx->last_event_command = command;
    ctx->last_event_status = status;
}

static const char *smbus_get_port_name_from_id(uint8_t port_id)
{
    switch (port_id)
    {
        case SMBUS_SLAVE_PORT_I2C1:
            return "I2C1";

        case SMBUS_SLAVE_PORT_I2C0:
            return "I2C0";

        case SMBUS_SLAVE_PORT_USCI0:
            return "USCI0";

        default:
            break;
    }

    return "?";
}

#if PMBUS_DEBUG_ENABLE
static const char *smbus_debug_get_command_name(uint8_t command)
{
    switch (command)
    {
        case SMBUS_SLAVE_PMBUS_CLEAR_FAULTS:
            return "CLEAR_FAULTS";

        case SMBUS_SLAVE_PMBUS_REVISION:
            return "PMBUS_REVISION";

        case SMBUS_SLAVE_PMBUS_MFR_ID:
            return "MFR_ID";

        case SMBUS_SLAVE_PMBUS_MFR_MODEL:
            return "MFR_MODEL";

        default:
            break;
    }

    return "UNKNOWN";
}

static const char *smbus_debug_get_protocol_name(uint8_t protocol)
{
    switch (protocol)
    {
        case SMBUS_DEBUG_PROTOCOL_SEND_BYTE:
            return "SEND_BYTE";

        case SMBUS_DEBUG_PROTOCOL_WRITE_BYTE:
            return "WRITE_BYTE";

        case SMBUS_DEBUG_PROTOCOL_WRITE_WORD:
            return "WRITE_WORD";

        case SMBUS_DEBUG_PROTOCOL_READ_BYTE:
            return "READ_BYTE";

        case SMBUS_DEBUG_PROTOCOL_READ_WORD:
            return "READ_WORD";

        case SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE:
            return "BLOCK_WRITE";

        case SMBUS_DEBUG_PROTOCOL_BLOCK_READ:
            return "BLOCK_READ";

        default:
            break;
    }

    return "UNKNOWN";
}

static uint8_t smbus_debug_read_protocol_from_flags(uint8_t flags)
{
    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_READ_BYTE;
    }

    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_WORD) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_READ_WORD;
    }

    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ) != 0U)
    {
        return SMBUS_DEBUG_PROTOCOL_BLOCK_READ;
    }

    return SMBUS_DEBUG_PROTOCOL_NONE;
}

static uint8_t smbus_debug_protocol_from_core(uint8_t protocol, uint8_t flags)
{
    switch (protocol)
    {
        case SMBUS_PROTOCOL_READ:
            return smbus_debug_read_protocol_from_flags(flags);

        case SMBUS_PROTOCOL_BLOCK_WRITE:
            return SMBUS_DEBUG_PROTOCOL_BLOCK_WRITE;

        case SMBUS_PROTOCOL_WRITE_BYTE:
            return SMBUS_DEBUG_PROTOCOL_WRITE_BYTE;

        case SMBUS_PROTOCOL_WRITE_WORD:
            return SMBUS_DEBUG_PROTOCOL_WRITE_WORD;

        case SMBUS_PROTOCOL_SEND_BYTE:
            return SMBUS_DEBUG_PROTOCOL_SEND_BYTE;

        default:
            break;
    }

    return SMBUS_DEBUG_PROTOCOL_NONE;
}

static void smbus_debug_capture_rx(SMBUS_SLAVE_CONTEXT_T *ctx,
                                   uint8_t command,
                                   uint8_t raw_length,
                                   uint8_t payload_length,
                                   uint8_t protocol,
                                   uint8_t repeated_start,
                                   uint8_t pec_present,
                                   uint8_t pec_valid)
{
#if PMBUS_DEBUG_PRINT_RX_FRAME
    SMBUS_DEBUG_RX_FRAME_T *record;
    uint8_t index;
    uint8_t capped_length;
    uint8_t next_head;
    uint8_t next_tail;

    capped_length = raw_length;
    if (capped_length > SMBUS_SLAVE_RX_BUFFER_SIZE)
    {
        capped_length = SMBUS_SLAVE_RX_BUFFER_SIZE;
    }

    record = &ctx->debug_rx_queue[ctx->debug_rx_head];
    record->command = command;
    record->raw_length = capped_length;
    record->payload_length = payload_length;
    record->protocol = protocol;
    record->repeated_start = repeated_start;
    record->pec_present = pec_present;
    record->pec_valid = pec_valid;

    for (index = 0U; index < capped_length; index++)
    {
        record->raw[index] = ctx->rx_buffer[index];
    }

    next_head = (uint8_t)(ctx->debug_rx_head + 1U);
    if (next_head >= PMBUS_DEBUG_FRAME_QUEUE_SIZE)
    {
        next_head = 0U;
    }

    if (ctx->debug_rx_count >= PMBUS_DEBUG_FRAME_QUEUE_SIZE)
    {
        next_tail = (uint8_t)(ctx->debug_rx_tail + 1U);
        if (next_tail >= PMBUS_DEBUG_FRAME_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_rx_tail = next_tail;
        if (ctx->debug_rx_dropped < 0xFFU)
        {
            ctx->debug_rx_dropped = (uint8_t)(ctx->debug_rx_dropped + 1U);
        }
    }
    else
    {
        ctx->debug_rx_count = (uint8_t)(ctx->debug_rx_count + 1U);
    }

    ctx->debug_rx_head = next_head;
    ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_RX);
#else
    ctx = ctx;
    command = command;
    raw_length = raw_length;
    payload_length = payload_length;
    protocol = protocol;
    repeated_start = repeated_start;
    pec_present = pec_present;
    pec_valid = pec_valid;
#endif
}

static void smbus_debug_capture_tx(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command, uint8_t protocol)
{
#if PMBUS_DEBUG_PRINT_TX_READY
    SMBUS_DEBUG_TX_FRAME_T *record;
    uint8_t index;
    uint8_t capped_length;
    uint8_t next_head;
    uint8_t next_tail;

    capped_length = ctx->tx_length;
    if (capped_length > SMBUS_SLAVE_TX_BUFFER_SIZE)
    {
        capped_length = SMBUS_SLAVE_TX_BUFFER_SIZE;
    }

    record = &ctx->debug_tx_queue[ctx->debug_tx_head];
    record->command = command;
    record->protocol = protocol;
    record->length = capped_length;

    for (index = 0U; index < capped_length; index++)
    {
        record->raw[index] = ctx->tx_buffer[index];
    }

