released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    next_head = (uint8_t)(ctx->debug_tx_head + 1U);
    if (next_head >= PMBUS_DEBUG_TX_QUEUE_SIZE)
    {
        next_head = 0U;
    }

    if (ctx->debug_tx_count >= PMBUS_DEBUG_TX_QUEUE_SIZE)
    {
        next_tail = (uint8_t)(ctx->debug_tx_tail + 1U);
        if (next_tail >= PMBUS_DEBUG_TX_QUEUE_SIZE)
        {
            next_tail = 0U;
        }
        ctx->debug_tx_tail = next_tail;
        if (ctx->debug_tx_dropped < 0xFFU)
        {
            ctx->debug_tx_dropped = (uint8_t)(ctx->debug_tx_dropped + 1U);
        }
    }
    else
    {
        ctx->debug_tx_count = (uint8_t)(ctx->debug_tx_count + 1U);
    }

    ctx->debug_tx_head = next_head;
    ctx->event_flags = (uint8_t)(ctx->event_flags | SMBUS_EVENT_DEBUG_TX);
#else
    ctx = ctx;
    command = command;
    protocol = protocol;
#endif
}

static void smbus_debug_print_raw_bytes(const uint8_t *data, uint8_t length)
{
    uint8_t index;

    for (index = 0U; index < length; index++)
    {
        if (index != 0U)
        {
            printf(" ");
        }
        printf("%02X", (unsigned int)data[index]);
    }
}
#endif

static void smbus_set_ack(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->ack_next = 1U;
}

static void smbus_clear_ack(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->ack_next = 0U;
}

static void smbus_reset_rx(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->rx_length = 0U;
    ctx->pending_read = 0U;
    ctx->command_length_without_pec = 0U;
}

static void smbus_reset_tx(SMBUS_SLAVE_CONTEXT_T *ctx)
{
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
}

#if PMBUS_ENABLE_PEC
static uint8_t smbus_pec_update(uint8_t crc, uint8_t data_byte)
{
    uint8_t bit_index;

    crc = (uint8_t)(crc ^ data_byte);
    for (bit_index = 0U; bit_index < 8U; bit_index++)
    {
        if ((crc & 0x80U) != 0U)
        {
            crc = (uint8_t)((crc << 1) ^ 0x07U);
        }
        else
        {
            crc = (uint8_t)(crc << 1);
        }
    }

    return crc;
}

static uint8_t smbus_compute_write_pec(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t frame_length_without_pec)
{
    uint8_t crc;
    uint8_t index;

    crc = 0U;
    crc = smbus_pec_update(crc, SMBUS_ADDRESS_WRITE(ctx->address_7bit));
    for (index = 0U; index < frame_length_without_pec; index++)
    {
        crc = smbus_pec_update(crc, ctx->rx_buffer[index]);
    }

    return crc;
}

static void smbus_append_read_pec(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command_length)
{
    uint8_t crc;
    uint8_t index;

    if (ctx->tx_length >= SMBUS_SLAVE_TX_BUFFER_SIZE)
    {
        return;
    }

    crc = 0U;
    crc = smbus_pec_update(crc, SMBUS_ADDRESS_WRITE(ctx->address_7bit));
    for (index = 0U; index < command_length; index++)
    {
        crc = smbus_pec_update(crc, ctx->rx_buffer[index]);
    }

    crc = smbus_pec_update(crc, SMBUS_ADDRESS_READ(ctx->address_7bit));
    for (index = 0U; index < ctx->tx_length; index++)
    {
        crc = smbus_pec_update(crc, ctx->tx_buffer[index]);
    }

    ctx->tx_buffer[ctx->tx_length] = crc;
    ctx->tx_length = (uint8_t)(ctx->tx_length + 1U);
}
#endif

static uint8_t smbus_get_builtin_command_flags(uint8_t command)
{
    uint8_t flags;

    flags = 0U;
    switch (command)
    {
        case SMBUS_SLAVE_PMBUS_CLEAR_FAULTS:
            flags = SMBUS_SLAVE_COMMAND_FLAG_SEND_BYTE;
            break;

        case SMBUS_SLAVE_PMBUS_REVISION:
            flags = SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE;
            break;

        case SMBUS_SLAVE_PMBUS_MFR_ID:
        case SMBUS_SLAVE_PMBUS_MFR_MODEL:
            flags = SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ;
            break;

        default:
            break;
    }

    return flags;
}

static uint8_t smbus_get_command_flags(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command)
{
    uint8_t flags;
    uint8_t user_flags;

    flags = smbus_get_builtin_command_flags(command);
    user_flags = 0U;
    if (SMBusSlave_UserGetCommandFlags(ctx->port_id, command, &user_flags) != 0U)
    {
        flags = (uint8_t)(flags | user_flags);
    }

    return flags;
}

static uint8_t smbus_length_matches_protocol(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t flags, uint8_t length, uint8_t *protocol)
{
    uint8_t count;

    *protocol = (uint8_t)SMBUS_PROTOCOL_NONE;

    if ((length == 1U) &&
        ((flags & (SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE |
                   SMBUS_SLAVE_COMMAND_FLAG_READ_WORD |
                   SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ)) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_READ;
        return 1U;
    }

    if ((length == 1U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_SEND_BYTE) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_SEND_BYTE;
        return 1U;
    }

    if ((length == 2U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_WRITE_BYTE) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_WRITE_BYTE;
        return 1U;
    }

    if ((length == 3U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_WRITE_WORD) != 0U))
    {
        *protocol = (uint8_t)SMBUS_PROTOCOL_WRITE_WORD;
        return 1U;
    }

    if ((length >= 2U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_WRITE) != 0U))
    {
        count = ctx->rx_buffer[1];
        if ((count <= SMBUS_SLAVE_MAX_BLOCK_SIZE) &&
            (length == (uint8_t)(count + 2U)))
        {
            *protocol = (uint8_t)SMBUS_PROTOCOL_BLOCK_WRITE;
            return 1U;
        }
    }

    return 0U;
}

static uint8_t smbus_select_effective_length(SMBUS_SLAVE_CONTEXT_T *ctx,
                                             uint8_t flags,
                                             uint8_t *effective_length,
                                             uint8_t *pec_present,
                                             uint8_t *pec_valid)
{
#if PMBUS_ENABLE_PEC
    uint8_t candidate_length;
    uint8_t protocol;
    uint8_t protocol_no_pec;
    uint8_t computed_pec;
    uint8_t last_byte;
#else
    flags = flags;
#endif

    *effective_length = ctx->rx_length;
    *pec_present = 0U;
    *pec_valid = 1U;

#if PMBUS_ENABLE_PEC
    if (ctx->rx_length <= 1U)
    {
#if (PMBUS_PEC_POLICY == PMBUS_PEC_POLICY_REQUIRED)
        if (smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol) != 0U)
        {
            if (protocol != (uint8_t)SMBUS_PROTOCOL_READ)
            {
                *pec_valid = 0U;
                return 0U;
            }
        }
#endif
        return 1U;
    }

    candidate_length = (uint8_t)(ctx->rx_length - 1U);
    if (smbus_length_matches_protocol(ctx, flags, candidate_length, &protocol) != 0U)
    {
        computed_pec = smbus_compute_write_pec(ctx, candidate_length);
        last_byte = ctx->rx_buffer[ctx->rx_length - 1U];
        if (last_byte == computed_pec)
        {
            *effective_length = candidate_length;
            *pec_present = 1U;
            return 1U;
        }

        protocol_no_pec = (uint8_t)SMBUS_PROTOCOL_NONE;
        if ((smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol_no_pec) == 0U) ||
            ((PMBUS_PEC_POLICY == PMBUS_PEC_POLICY_REQUIRED) &&
             (protocol_no_pec != (uint8_t)SMBUS_PROTOCOL_READ)))
        {
            *effective_length = candidate_length;
            *pec_present = 1U;
            *pec_valid = 0U;
            return 0U;
        }
    }

#if (PMBUS_PEC_POLICY == PMBUS_PEC_POLICY_REQUIRED)
    if (smbus_length_matches_protocol(ctx, flags, ctx->rx_length, &protocol) != 0U)
    {
        if (protocol != (uint8_t)SMBUS_PROTOCOL_READ)
        {
            *pec_valid = 0U;
            return 0U;
        }
    }
#endif
#endif

