released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    return 1U;
}

static uint8_t smbus_builtin_read_byte(uint8_t command, uint8_t *value)
{
    if (command == SMBUS_SLAVE_PMBUS_REVISION)
    {
        *value = 0x33U;
        return 1U;
    }

    return 0U;
}

static uint8_t smbus_copy_block_string(const char *text, uint8_t *data, uint8_t *length)
{
    uint8_t copy_length;
    uint8_t index;

    copy_length = (uint8_t)strlen(text);
    if (copy_length > SMBUS_SLAVE_MAX_BLOCK_SIZE)
    {
        copy_length = SMBUS_SLAVE_MAX_BLOCK_SIZE;
    }

    for (index = 0U; index < copy_length; index++)
    {
        data[index] = (uint8_t)text[index];
    }

    *length = copy_length;
    return 1U;
}

static uint8_t smbus_builtin_block_read(uint8_t command, uint8_t *data, uint8_t *length)
{
    if (command == SMBUS_SLAVE_PMBUS_MFR_ID)
    {
        return smbus_copy_block_string(g_smbus_mfr_id, data, length);
    }

    if (command == SMBUS_SLAVE_PMBUS_MFR_MODEL)
    {
        return smbus_copy_block_string(g_smbus_mfr_model, data, length);
    }

    return 0U;
}

static uint8_t smbus_builtin_send_byte(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command)
{
    if (command == SMBUS_SLAVE_PMBUS_CLEAR_FAULTS)
    {
        ctx->status_word = 0U;
        return 1U;
    }

    return 0U;
}

static void smbus_prepare_error_response(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t command, uint8_t status)
{
    ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
    ctx->tx_buffer[0] = 0x00U;
    ctx->tx_length = 1U;
    ctx->tx_index = 0U;
    smbus_set_event(ctx, SMBUS_EVENT_UNSUPPORTED, command, status);
}

static void smbus_prepare_read_response(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    uint8_t command;
    uint8_t flags;
    uint8_t length;
    uint8_t value;
    uint16_t word_value;
    uint8_t handled;
#if PMBUS_DEBUG_ENABLE
    uint8_t debug_protocol;
#endif

    command = ctx->rx_buffer[0];
    flags = smbus_get_command_flags(ctx, command);
    ctx->tx_length = 0U;
    ctx->tx_index = 0U;
    handled = 0U;
#if PMBUS_DEBUG_ENABLE
    debug_protocol = smbus_debug_read_protocol_from_flags(flags);
#endif

    if ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_BYTE) != 0U)
    {
        if ((smbus_builtin_read_byte(command, &value) != 0U) ||
            (SMBusSlave_UserReadByte(ctx->port_id, command, &value) != 0U))
        {
            ctx->tx_buffer[0] = value;
            ctx->tx_length = 1U;
            handled = 1U;
        }
    }

    if ((handled == 0U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_READ_WORD) != 0U))
    {
        if (SMBusSlave_UserReadWord(ctx->port_id, command, &word_value) != 0U)
        {
            ctx->tx_buffer[0] = (uint8_t)(word_value & 0x00FFU);
            ctx->tx_buffer[1] = (uint8_t)((word_value >> 8) & 0x00FFU);
            ctx->tx_length = 2U;
            handled = 1U;
        }
    }

    if ((handled == 0U) && ((flags & SMBUS_SLAVE_COMMAND_FLAG_BLOCK_READ) != 0U))
    {
        length = 0U;
        if ((smbus_builtin_block_read(command, &ctx->tx_buffer[1], &length) != 0U) ||
            (SMBusSlave_UserBlockRead(ctx->port_id, command, &ctx->tx_buffer[1], &length) != 0U))
        {
            if (length > SMBUS_SLAVE_MAX_BLOCK_SIZE)
            {
                length = SMBUS_SLAVE_MAX_BLOCK_SIZE;
            }
            ctx->tx_buffer[0] = length;
            ctx->tx_length = (uint8_t)(length + 1U);
            handled = 1U;
        }
    }

    if (handled == 0U)
    {
        smbus_prepare_error_response(ctx, command, status);
    }
    else
    {
#if PMBUS_ENABLE_PEC
        smbus_append_read_pec(ctx, ctx->command_length_without_pec);
#endif
    }

#if PMBUS_DEBUG_ENABLE
    smbus_debug_capture_tx(ctx, command, debug_protocol);
#endif
}

static void smbus_execute_write_protocol(SMBUS_SLAVE_CONTEXT_T *ctx,
                                         uint8_t command,
                                         uint8_t protocol,
                                         uint8_t effective_length,
                                         uint8_t pec_present,
                                         uint8_t pec_valid,
                                         uint8_t status)
{
    uint8_t handled;
    uint8_t count;
    uint16_t word_value;

    handled = 0U;

    switch (protocol)
    {
        case SMBUS_PROTOCOL_SEND_BYTE:
            handled = smbus_builtin_send_byte(ctx, command);
            if (handled == 0U)
            {
                handled = SMBusSlave_UserSendByte(ctx->port_id, command, pec_present, pec_valid);
            }
            break;

        case SMBUS_PROTOCOL_WRITE_BYTE:
            handled = SMBusSlave_UserWriteByte(ctx->port_id, command, ctx->rx_buffer[1], pec_present, pec_valid);
            break;

        case SMBUS_PROTOCOL_WRITE_WORD:
            word_value = ((uint16_t)ctx->rx_buffer[1]) |
                         ((uint16_t)ctx->rx_buffer[2] << 8);
            handled = SMBusSlave_UserWriteWord(ctx->port_id, command, word_value, pec_present, pec_valid);
            break;

        case SMBUS_PROTOCOL_BLOCK_WRITE:
            count = ctx->rx_buffer[1];
            if (effective_length == (uint8_t)(count + 2U))
            {
                handled = SMBusSlave_UserBlockWrite(ctx->port_id,
                                                    command,
                                                    &ctx->rx_buffer[2],
                                                    count,
                                                    pec_present,
                                                    pec_valid);
            }
            break;

        default:
            break;
    }

    if (handled == 0U)
    {
        smbus_prepare_error_response(ctx, command, status);
    }
    else
    {
        smbus_set_event(ctx, SMBUS_EVENT_WRITE_DONE, command, status);
    }
}

static void smbus_process_stop_or_restart(SMBUS_SLAVE_CONTEXT_T *ctx, uint8_t status)
{
    uint8_t command;
    uint8_t flags;
    uint8_t effective_length;
    uint8_t pec_present;
    uint8_t pec_valid;
    uint8_t protocol;
#if PMBUS_DEBUG_ENABLE
    uint8_t debug_payload_length;
    uint8_t debug_protocol;
    uint8_t debug_repeated_start;
#endif

    if (ctx->rx_length == 0U)
    {
        return;
    }

    command = ctx->rx_buffer[0];
    flags = smbus_get_command_flags(ctx, command);
    if (smbus_select_effective_length(ctx, flags, &effective_length, &pec_present, &pec_valid) == 0U)
    {
#if PMBUS_DEBUG_ENABLE
        debug_payload_length = 0U;
        if (effective_length > 0U)
        {
            debug_payload_length = (uint8_t)(effective_length - 1U);
        }
        smbus_debug_capture_rx(ctx,
                               command,
                               ctx->rx_length,
                               debug_payload_length,
                               SMBUS_DEBUG_PROTOCOL_NONE,
                               0U,
                               pec_present,
                               pec_valid);
#endif
        ctx->status_word = (uint16_t)(ctx->status_word | SMBUS_STATUS_WORD_CML);
        smbus_set_event(ctx, SMBUS_EVENT_PEC_ERROR, command, status);
        smbus_reset_rx(ctx);
        smbus_reset_tx(ctx);
        return;
    }

