released/M031BSP_Software_SGPIO_I2C_Slave/SampleCode/Template/smbus_slave.c
    if ((snapshot->events & SMBUS_EVENT_TIMEOUT) != 0U)
    {
        printf("[SMBus %s] timeout, SCL low/stuck count=%u status=0x%02X\r\n",
               port_name,
               (unsigned int)snapshot->timeout_count,
               (unsigned int)snapshot->status);
    }
    if ((snapshot->events & SMBUS_EVENT_BUS_ERROR) != 0U)
    {
        printf("[SMBus %s] bus error status=0x%02X\r\n",
               port_name,
               (unsigned int)snapshot->status);
    }
    if ((snapshot->events & SMBUS_EVENT_PEC_ERROR) != 0U)
    {
        printf("[SMBus %s] PEC error cmd=0x%02X status=0x%02X\r\n",
               port_name,
               (unsigned int)snapshot->command,
               (unsigned int)snapshot->status);
    }
    if ((snapshot->events & SMBUS_EVENT_UNSUPPORTED) != 0U)
    {
        printf("[SMBus %s] unsupported cmd=0x%02X status=0x%02X\r\n",
               port_name,
               (unsigned int)snapshot->command,
               (unsigned int)snapshot->status);
    }
    if ((snapshot->events & SMBUS_EVENT_WRITE_DONE) != 0U)
    {
        printf("[SMBus %s] write done cmd=0x%02X\r\n",
               port_name,
               (unsigned int)snapshot->command);
    }
    if ((snapshot->events & SMBUS_EVENT_RECOVERED) != 0U)
    {
        printf("[SMBus %s] slave recovered\r\n", port_name);
    }
}

__WEAK uint8_t SMBusSlave_UserGetCommandFlags(uint8_t port_id, uint8_t command, uint8_t *flags)
{
    port_id = port_id;
    command = command;
    if (flags != 0)
    {
        *flags = 0U;
    }
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserReadByte(uint8_t port_id, uint8_t command, uint8_t *value)
{
    port_id = port_id;
    command = command;
    value = value;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserReadWord(uint8_t port_id, uint8_t command, uint16_t *value)
{
    port_id = port_id;
    command = command;
    value = value;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserBlockRead(uint8_t port_id, uint8_t command, uint8_t *data, uint8_t *length)
{
    port_id = port_id;
    command = command;
    data = data;
    length = length;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserSendByte(uint8_t port_id, uint8_t command, uint8_t pec_present, uint8_t pec_valid)
{
    port_id = port_id;
    command = command;
    pec_present = pec_present;
    pec_valid = pec_valid;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserWriteByte(uint8_t port_id, uint8_t command, uint8_t value, uint8_t pec_present, uint8_t pec_valid)
{
    port_id = port_id;
    command = command;
    value = value;
    pec_present = pec_present;
    pec_valid = pec_valid;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserWriteWord(uint8_t port_id, uint8_t command, uint16_t value, uint8_t pec_present, uint8_t pec_valid)
{
    port_id = port_id;
    command = command;
    value = value;
    pec_present = pec_present;
    pec_valid = pec_valid;
    return 0U;
}

__WEAK uint8_t SMBusSlave_UserBlockWrite(uint8_t port_id,
                                         uint8_t command,
                                         const uint8_t *data,
                                         uint8_t length,
                                         uint8_t pec_present,
                                         uint8_t pec_valid)
{
    port_id = port_id;
    command = command;
    data = data;
    length = length;
    pec_present = pec_present;
    pec_valid = pec_valid;
    return 0U;
}

__WEAK void SMBusSlave_UserTimeoutError(uint8_t port_id)
{
    port_id = port_id;
}
